# ShowDownText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPath..::..ShowDownText Property
StairsPath Class See Also
---
Represents whether show stairs down text or not.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowDownText { get; set; }
```

Visual Basic
---
```text
Public Property ShowDownText As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowDownText {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The type of this stairs path is not automatic up/down direction. |

# See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace